wolfSSL/wolfip/src/port/stm32h563/main.c
/* main.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfIP TCP/IP stack.
 *
 * wolfIP is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfIP is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */
#include <stdint.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include "config.h"
#include "wolfip.h"
#include "stm32_eth.h"

#ifdef WOLFIP_USE_FREERTOS
#include "FreeRTOS.h"
#include "portable.h"
#include "task.h"
#include "bsd_socket.h"
#include "echo_server_freertos.h"
#endif

#ifdef ENABLE_TLS
#include "tls_server.h"
#include "tls_client.h"
#define TLS_PORT 8443
#endif

#ifdef ENABLE_HTTPS
#ifdef WOLFIP_USE_FREERTOS
#include "https_server_freertos.h"
#else
#include "http/httpd.h"
#include "certs.h"
#endif
#define HTTPS_WEB_PORT 443
#endif

#ifdef ENABLE_SSH
#include "ssh_server.h"
#define SSH_PORT 22
#endif

#ifdef ENABLE_MQTT
#include "mqtt_client.h"
#endif

#ifdef ENABLE_MQTT_BROKER
#include "mqtt_broker.h"
/* Defined in mqtt_broker.c, updated from main loop tick */
extern volatile unsigned long broker_uptime_sec;
#endif

#ifdef ENABLE_TFTP
#include "tftp_client_demo.h"
#endif

#ifdef ENABLE_DOT1X
#include "dot1x_client.h"
#endif

#ifdef ENABLE_TLS_CLIENT

/* Google IP for TLS client test (run: dig +short google.com) */
#define GOOGLE_IP "142.250.189.174"
#define GOOGLE_HTTPS_PORT 443

/* TLS client test state */
static int tls_client_test_started = 0;
static int tls_client_test_done = 0;
#endif

/* Forward declarations */
void uart_puts(const char *s);
static void delay(uint32_t count);

/* =========================================================================
 * HardFault Handler - prints crash info via UART
 * ========================================================================= */
#define SCB_HFSR   (*(volatile uint32_t *)0xE000ED2CUL)
#define SCB_CFSR   (*(volatile uint32_t *)0xE000ED28UL)
#define SCB_BFAR   (*(volatile uint32_t *)0xE000ED38UL)
#define SCB_MMFAR  (*(volatile uint32_t *)0xE000ED34UL)

#define FAULT_USART3_ISR (*(volatile uint32_t *)(0x40004800u + 0x1Cu))
#define FAULT_USART3_TDR (*(volatile uint32_t *)(0x40004800u + 0x28u))

static void fault_uart_putc(char c)
{
    while ((FAULT_USART3_ISR & (1u << 7)) == 0) { }
    FAULT_USART3_TDR = (uint32_t)c;
}
static void fault_uart_puts(const char *s)
{
    while (*s) {
        if (*s == '\n') fault_uart_putc('\r');
        fault_uart_putc(*s++);
    }
}
static void fault_uart_puthex(uint32_t val)
{
    const char hex[] = "0123456789ABCDEF";
    fault_uart_puts("0x");
    for (int i = 28; i >= 0; i -= 4)
        fault_uart_putc(hex[(val >> i) & 0xF]);
}

void hard_fault_handler_c(uint32_t *frame)
{
    fault_uart_puts("\n\n*** HARD FAULT ***\n");
    fault_uart_puts("  PC:   "); fault_uart_puthex(frame[6]); fault_uart_puts("\n");
    fault_uart_puts("  LR:   "); fault_uart_puthex(frame[5]); fault_uart_puts("\n");
    fault_uart_puts("  R0:   "); fault_uart_puthex(frame[0]); fault_uart_puts("\n");
    fault_uart_puts("  R1:   "); fault_uart_puthex(frame[1]); fault_uart_puts("\n");
    fault_uart_puts("  R2:   "); fault_uart_puthex(frame[2]); fault_uart_puts("\n");
    fault_uart_puts("  R3:   "); fault_uart_puthex(frame[3]); fault_uart_puts("\n");
    fault_uart_puts("  R12:  "); fault_uart_puthex(frame[4]); fault_uart_puts("\n");
    fault_uart_puts("  xPSR: "); fault_uart_puthex(frame[7]); fault_uart_puts("\n");
    fault_uart_puts("  HFSR: "); fault_uart_puthex(SCB_HFSR); fault_uart_puts("\n");
    fault_uart_puts("  CFSR: "); fault_uart_puthex(SCB_CFSR); fault_uart_puts("\n");
    if (SCB_CFSR & 0x00008200u) {
        fault_uart_puts("  BFAR: "); fault_uart_puthex(SCB_BFAR); fault_uart_puts("\n");
    }
    if (SCB_CFSR & 0x00000082u) {
        fault_uart_puts("  MMFAR:"); fault_uart_puthex(SCB_MMFAR); fault_uart_puts("\n");
    }
    /* Turn off LED2 (PF4) as fault indicator */
    (*(volatile uint32_t *)(0x42021400u + 0x18u)) = (1u << (4u + 16u));
    while (1) { }
}

void HardFault_Handler(void) __attribute__((naked));
void HardFault_Handler(void)
{
    __asm volatile(
        "tst lr, #4       \n"
        "ite eq            \n"
        "mrseq r0, msp     \n"
        "mrsne r0, psp     \n"
        "b hard_fault_handler_c \n"
    );
}

#if defined(ENABLE_HTTPS) && !defined(WOLFIP_USE_FREERTOS)
/* HTTPS server using wolfIP httpd */
static struct httpd https_server;
static WOLFSSL_CTX *https_ssl_ctx;
static uint32_t https_uptime_sec;
static ip4 https_device_ip;

/* Status page handler */
static int https_status_handler(struct httpd *httpd, struct http_client *hc,
    struct http_request *req)
{
    char response[512];
    char ip_str[16];
    char uptime_str[12];
    int len;

    (void)httpd;

    uart_puts("HTTPS: ");
    uart_puts(req->method);
    uart_puts(" ");
    uart_puts(req->path);
    uart_puts("\n");

    /* Format IP address (stored in network byte order) */
    {
        uint8_t *b = (uint8_t *)&https_device_ip;
        char *p = ip_str;
        for (int i = 3; i >= 0; i--) {  /* Reverse order for network byte order */
            int val = b[i];
            if (val >= 100) { *p++ = '0' + val / 100; val %= 100; }
            if (val >= 10 || b[i] >= 100) { *p++ = '0' + val / 10; val %= 10; }
            *p++ = '0' + val;
            if (i > 0) *p++ = '.';
        }
        *p = '\0';
    }

    /* Format uptime */
    {
        uint32_t val = https_uptime_sec;
        char tmp[12];
        int i = 0, j = 0;
        if (val == 0) { uptime_str[0] = '0'; uptime_str[1] = '\0'; }
        else {
            while (val > 0) { tmp[i++] = '0' + (val % 10); val /= 10; }
            while (i > 0) { uptime_str[j++] = tmp[--i]; }
            uptime_str[j] = '\0';
        }
    }

    /* Build HTML response */
    len = snprintf(response, sizeof(response),
        "<!DOCTYPE html><html><head><title>wolfIP STM32H563</title>"
        "<style>body{font-family:sans-serif;margin:40px;}"
        "h1{color:#333;}table{border-collapse:collapse;}"
        "td{padding:8px 16px;border:1px solid #ddd;}</style></head>"
        "<body><h1>wolfIP Status</h1><table>"
        "<tr><td>Device</td><td>STM32H563</td></tr>"
        "<tr><td>IP Address</td><td>%s</td></tr>"
        "<tr><td>Uptime</td><td>%s sec</td></tr>"
        "<tr><td>TLS</td><td>TLS 1.3</td></tr>"
        "</table></body></html>",
        ip_str, uptime_str);

