wolfSSL/wolfip/src/port/stm32h563/main.c
    http_send_response_headers(hc, HTTP_STATUS_OK, "OK", "text/html", len);
    http_send_response_body(hc, response, len);
    return 0;
}
#endif

#define ECHO_PORT 7
#define RX_BUF_SIZE 1024

/* Non-secure peripheral aliases. wolfIP runs in NS world in both modes:
 *   TZEN=0: TrustZone disabled, only NS aliases exist.
 *   TZEN=1: wolfBoot is the secure stub and BLXNSs into this app, which
 *           runs entirely in NS. Plain LDR/STR carry HNONSEC=1 and must
 *           target the NS aliases (0x4xxxxxxx). */
#define RCC_BASE 0x44020C00u
#define ETH_BASE_DBG 0x40028000u
#define RCC_AHB1ENR  (*(volatile uint32_t *)(RCC_BASE + 0x88u))
#define RCC_AHB2ENR  (*(volatile uint32_t *)(RCC_BASE + 0x8Cu))
#define RCC_APB3ENR  (*(volatile uint32_t *)(RCC_BASE + 0xA8u))
#define RCC_CR       (*(volatile uint32_t *)(RCC_BASE + 0x00u))
#define RCC_CCIPR5   (*(volatile uint32_t *)(RCC_BASE + 0xE8u))
#define RCC_AHB1RSTR (*(volatile uint32_t *)(RCC_BASE + 0x60u))
#define RCC_AHB1RSTR_ETHRST (1u << 19)
#define RCC_AHB2ENR_RNGEN   (1u << 18)
#define RCC_CR_HSI48ON      (1u << 12)
#define RCC_CR_HSI48RDY     (1u << 13)
#define RCC_CCIPR5_RNGSEL_Msk (3u << 4)

/* GPIO base addresses (NS aliases; see RCC_BASE comment above). */
#define GPIOA_BASE 0x42020000u
#define GPIOB_BASE 0x42020400u
#define GPIOC_BASE 0x42020800u
#define GPIOG_BASE 0x42021800u

/* GPIO register offsets */
#define GPIO_MODER(base)   (*(volatile uint32_t *)((base) + 0x00u))
#define GPIO_OSPEEDR(base) (*(volatile uint32_t *)((base) + 0x08u))
#define GPIO_PUPDR(base)   (*(volatile uint32_t *)((base) + 0x0Cu))
#define GPIO_AFRL(base)    (*(volatile uint32_t *)((base) + 0x20u))
#define GPIO_AFRH(base)    (*(volatile uint32_t *)((base) + 0x24u))

/* SBS (System Bus Security) for RMII selection.
 * PMCR is at offset 0x100 in SBS structure. SBS is NS-default in TZSC
 * and is used unconditionally from NS world here. */
#define SBS_BASE        0x44000400u
#define SBS_PMCR        (*(volatile uint32_t *)(SBS_BASE + 0x100u))
#define SBS_PMCR_ETH_SEL_RMII (4u << 21)

/* USART3 for debug output (ST-Link VCP on NUCLEO-H563ZI) */
#define GPIOD_BASE 0x42020C00u
#define GPIOF_BASE 0x42021400u
#define RCC_APB1ENR (*(volatile uint32_t *)(RCC_BASE + 0x9Cu))
#define USART3_BASE 0x40004800u
#define USART3_CR1 (*(volatile uint32_t *)(USART3_BASE + 0x00u))
#define USART3_BRR (*(volatile uint32_t *)(USART3_BASE + 0x0Cu))
#define USART3_ISR (*(volatile uint32_t *)(USART3_BASE + 0x1Cu))
#define USART3_TDR (*(volatile uint32_t *)(USART3_BASE + 0x28u))

/* LED2 on PF4 */
#define GPIO_ODR(base)     (*(volatile uint32_t *)((base) + 0x14u))
#define GPIO_BSRR(base)    (*(volatile uint32_t *)((base) + 0x18u))
#define LED2_PIN 4u

#define RNG_BASE 0x420C0800u
#define RNG_CR   (*(volatile uint32_t *)(RNG_BASE + 0x00u))
#define RNG_SR   (*(volatile uint32_t *)(RNG_BASE + 0x04u))
#define RNG_DR   (*(volatile uint32_t *)(RNG_BASE + 0x08u))
#define RNG_CR_RNGEN          (1u << 2)
#define RNG_CR_CONDRST        (1u << 30)
#define RNG_CR_CONFIG3_SHIFT  8u
#define RNG_CR_CONFIG2_SHIFT  13u
#define RNG_CR_CLKDIV_SHIFT   16u
#define RNG_CR_CONFIG1_SHIFT  20u
#define RNG_SR_DRDY           (1u << 0)
#define RNG_SR_CECS           (1u << 1)
#define RNG_SR_SECS           (1u << 2)
#define RNG_SR_CEIS           (1u << 5)
#define RNG_SR_SEIS           (1u << 6)

static struct wolfIP *IPStack;
#ifndef WOLFIP_USE_FREERTOS
static int listen_fd = -1;
static int client_fd = -1;
static uint8_t rx_buf[RX_BUF_SIZE];
#endif

static void rng_init(void)
{
    uint32_t rng_cr;
    uint32_t timeout;

    RCC_CR |= RCC_CR_HSI48ON;
    /* Bounded waits throughout so emulators that do not model the
     * HSI48 / RNG status bits (m33mu) cannot deadlock here. The RNG
     * may not produce data on the emulator, but boot completes and
     * higher-level code can fall back. */
    timeout = 100000u;
    while (((RCC_CR & RCC_CR_HSI48RDY) == 0u) && (timeout != 0u)) {
        timeout--;
    }

    /* Select HSI48 as the RNG kernel clock. */
    RCC_CCIPR5 &= ~RCC_CCIPR5_RNGSEL_Msk;
    RCC_AHB2ENR |= RCC_AHB2ENR_RNGEN;
    delay(100);

    rng_cr = RNG_CR;
    rng_cr &= ~(0x1Fu << RNG_CR_CONFIG1_SHIFT);
    rng_cr &= ~(0x7u << RNG_CR_CLKDIV_SHIFT);
    rng_cr &= ~(0x3u << RNG_CR_CONFIG2_SHIFT);
    rng_cr &= ~(0x7u << RNG_CR_CONFIG3_SHIFT);
    rng_cr |= 0x0Fu << RNG_CR_CONFIG1_SHIFT;
    rng_cr |= 0x0Du << RNG_CR_CONFIG3_SHIFT;

    RNG_CR = RNG_CR_CONDRST | rng_cr;
    timeout = 100000u;
    while (((RNG_CR & RNG_CR_CONDRST) == 0u) && (timeout != 0u)) {
        timeout--;
    }
    RNG_CR = rng_cr | RNG_CR_RNGEN;
    timeout = 100000u;
    while (((RNG_SR & RNG_SR_DRDY) == 0u) && (timeout != 0u)) {
        timeout--;
    }
}

static int rng_get_word(uint32_t *out)
{
    uint32_t timeout = 100000u;

    while ((RNG_SR & RNG_SR_DRDY) == 0u) {
        if ((RNG_SR & (RNG_SR_CECS | RNG_SR_SECS | RNG_SR_CEIS | RNG_SR_SEIS)) != 0u) {
            rng_init();
            timeout = 100000u;
            continue;
        }
        if (--timeout == 0u) {
            return -1;
        }
    }

    *out = RNG_DR;
    return 0;
}

int custom_rand_gen_block(unsigned char *output, unsigned int sz)
{
    uint32_t word;

    while (sz >= 4u) {
        if (rng_get_word(&word) != 0) {
            return -1;
        }
        output[0] = (unsigned char)word;
        output[1] = (unsigned char)(word >> 8);
        output[2] = (unsigned char)(word >> 16);
        output[3] = (unsigned char)(word >> 24);
        output += 4;
        sz -= 4;
    }

    if (sz > 0u) {
        if (rng_get_word(&word) != 0) {
            return -1;
        }
        while (sz-- > 0u) {
            *output++ = (unsigned char)word;
            word >>= 8;
        }
    }

    return 0;
}

uint32_t wolfIP_getrandom(void)
{
    uint32_t word = 0u;

    (void)rng_get_word(&word);
    return word;
}

/* Simple delay */
static void delay(uint32_t count)
{
    for (volatile uint32_t i = 0; i < count; i++) { }
}

/* Initialize LED2 on PF4 */
static void led_init(void)
{
    uint32_t moder;

    /* Enable GPIOF clock */
    RCC_AHB2ENR |= (1u << 5);
    delay(100);

    /* Set PF4 as output */
    moder = GPIO_MODER(GPIOF_BASE);
    moder &= ~(3u << (LED2_PIN * 2u));
    moder |= (1u << (LED2_PIN * 2u));  /* Output mode */
    GPIO_MODER(GPIOF_BASE) = moder;
}

static void led_on(void)
{
    GPIO_BSRR(GPIOF_BASE) = (1u << LED2_PIN);
}

static void led_off(void)
{
    GPIO_BSRR(GPIOF_BASE) = (1u << (LED2_PIN + 16u));
}

#ifndef WOLFIP_USE_FREERTOS
static void led_toggle(void)
{
    GPIO_ODR(GPIOF_BASE) ^= (1u << LED2_PIN);
}
#endif

