wolfSSL/wolfip/src/port/stm32h563/main.c
    if ((fd == client_fd) && (event & CB_EVENT_READABLE)) {
        ret = wolfIP_sock_recvfrom(s, client_fd, rx_buf, sizeof(rx_buf), 0, NULL, NULL);
        if (ret > 0) {
            (void)wolfIP_sock_sendto(s, client_fd, rx_buf, (uint32_t)ret, 0, NULL, 0);
        } else if (ret == 0) {
            wolfIP_sock_close(s, client_fd);
            client_fd = -1;
        }
    }

    if ((fd == client_fd) && (event & CB_EVENT_CLOSED)) {
        wolfIP_sock_close(s, client_fd);
        client_fd = -1;
    }
}
#endif

#if TZEN_ENABLED
/* When the NS app is launched by wolfBoot, the chip arrives here with
 * the PLL programmed for 250 MHz SYSCLK / 250 MHz PCLK1
 * (hal/stm32h5.c:clock_pll_on, plln=62 pllp=2). wolfIP's USART3 BRR
 * and SysTick math assume HSI 64 MHz / HSIDIV=/2 / PCLK1 32 MHz (the
 * H5 reset default). Rather than recompute every peripheral divisor,
 * we revert clocks to that reset state before any peripheral init so
 * the rest of the port behaves identically to the TZEN=0 path. */
static void revert_sysclk_to_hsi(void)
{
    volatile uint32_t *rcc_cr     = (volatile uint32_t *)(RCC_BASE + 0x00u);
    volatile uint32_t *rcc_cfgr1  = (volatile uint32_t *)(RCC_BASE + 0x1Cu);
    volatile uint32_t *rcc_cfgr2  = (volatile uint32_t *)(RCC_BASE + 0x20u);
    uint32_t reg;
    uint32_t timeout;

    /* CFGR1.SW: 0=HSI, 1=CSI, 2=HSE, 3=PLL1. Select HSI and wait for
     * SWS (bits [3:5]) to confirm. Bounded retry so emulators that
     * do not toggle the SWS feedback bits (m33mu) cannot deadlock. */
    reg = *rcc_cfgr1;
    reg &= ~0x7u;
    *rcc_cfgr1 = reg;
    timeout = 100000u;
    while (((*rcc_cfgr1 & (0x7u << 3)) != 0u) && (timeout != 0u)) {
        timeout--;
    }

    /* CR.HSIDIV (bits 4:3, shift 3): 0=/1 (64M), 1=/2 (32M), 2=/4, 3=/8.
     * Per RM0481 Table 108. Force /2 to match the H5 reset default.
     * Wait for HSIDIVF (bit 5) to confirm propagation. Same bounded
     * retry so emulators without HSIDIVF feedback cannot deadlock. */
    reg = *rcc_cr;
    reg &= ~(0x3u << 3);
    reg |= (0x1u << 3);
    *rcc_cr = reg;
    timeout = 100000u;
    while (((*rcc_cr & (1u << 5)) == 0u) && (timeout != 0u)) {
        timeout--;
    }

    /* AHB and APB prescalers back to /1. */
    *rcc_cfgr2 = 0u;
}
#endif

int main(void)
{
    struct wolfIP_ll_dev *ll;
#ifndef WOLFIP_USE_FREERTOS
    struct wolfIP_sockaddr_in addr;
#endif
    uint64_t tick = 0;
    int ret;

#if TZEN_ENABLED
    revert_sysclk_to_hsi();
#endif

    /* Initialize LED first for debug - keep ON to confirm code is running */
    led_init();
    led_on();  /* LED ON = Reset_Handler ran, main() started */

    /* Initialize UART for debug output */
    uart_init();
    rng_init();

    /* Blink to show UART init done */
    led_off();
    delay(200000);
    led_on();
    delay(200000);
    led_off();
    delay(200000);
    led_on();

#ifdef WOLFIP_USE_FREERTOS
#ifdef ENABLE_HTTPS
    uart_puts("\n\n=== wolfIP STM32H563 FreeRTOS HTTPS Server ===\n");
#else
    uart_puts("\n\n=== wolfIP STM32H563 FreeRTOS Echo Server ===\n");
#endif
#else
    uart_puts("\n\n=== wolfIP STM32H563 Echo Server ===\n");
#endif

    /* Under TZEN=1 the application is launched by wolfBoot in NS world
     * (BLXNS from the secure stub). wolfBoot's hal_gtzc_init /
     * hal_tz_sau_init / periph_unsecure already programmed SAU, GTZC
     * MPCBB, and TZSC; this app does not (and cannot, from NS) touch
     * those. ETH, RCC, GPIO, RNG, and SBS are NS-default in TZSC and
     * accessible directly via the NS aliases used above. */

    uart_puts("Initializing wolfIP stack...\n");
    wolfIP_init_static(&IPStack);

    /* Initialize GPIO pins for RMII - MUST happen before Ethernet clocks! */
    uart_puts("Configuring GPIO for RMII...\n");
    eth_gpio_init();

    /* Enable Ethernet MAC, TX, RX clocks AFTER RMII mode is selected */
    uart_puts("Enabling Ethernet clocks...\n");
    RCC_AHB1ENR |= (1u << 19) | (1u << 20) | (1u << 21);
    delay(10000);  /* Allow clocks to stabilize */

    /* Reset Ethernet MAC via RCC - this is CRITICAL! (from FrostZone) */
    uart_puts("Resetting Ethernet MAC...\n");
    RCC_AHB1RSTR |= RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(1000);
    RCC_AHB1RSTR &= ~RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(10000);

#if TZEN_ENABLED
    /* The LAN8742A on NUCLEO-H563ZI is held in reset via NRST while
     * wolfBoot's SYSRESETREQ asserts it; the PHY needs up to 167 ms
     * after deassert to deliver REF_CLK on PA1. Without REF_CLK the
     * subsequent ETH DMA software reset (DMAMR.SWR) hangs and
     * stm32_eth_init returns -2. The TZEN=0 path inherits a much
     * longer board-power-on settle, so this only matters for the
     * wolfBoot-launched flow. ~200 ms at 32 MHz is enough headroom. */
    delay(2000000);
#endif

    uart_puts("Initializing Ethernet MAC...\n");
    ll = wolfIP_getdev(IPStack);
    ret = stm32_eth_init(ll, NULL);
    if (ret < 0) {
        uart_puts("  ERROR: stm32_eth_init failed (");
        uart_puthex((uint32_t)ret);
        uart_puts(")\n");
    } else {
        uart_puts("  PHY link: ");
        uart_puts((ret & 0x100) ? "UP" : "DOWN");
        uart_puts(", PHY addr: ");
        uart_puthex(ret & 0xFF);
        uart_puts("\n  MAC: ");
        {
            int mi;
            for (mi = 0; mi < 6; mi++) {
                if (mi > 0) uart_puts(":");
                uart_puthex8(ll->mac[mi]);
            }
        }
        uart_puts("\n");
    }

#ifdef ENABLE_DOT1X
    /* Wired IEEE 802.1X EAP-TLS: authenticate at layer 2 (EAPOL/0x888E)
     * before any IP setup. Self-contained one-shot against an 802.1X
     * authenticator such as hostapd driver=wired; needs no IP address. */
    uart_puts("\n=== Wired 802.1X EAP-TLS (wolfSupplicant) ===\n");
    if (dot1x_eaptls_run(IPStack, uart_puts) == 0) {
        uart_puts("=== 802.1X: AUTHENTICATED ===\n\n");
    } else {
        uart_puts("=== 802.1X: authentication FAILED ===\n\n");
    }
#endif

#ifdef ENABLE_VLAN
    /* 802.1Q VLAN sub-interface: create a logical interface on top of the
     * physical (untagged) interface and run all traffic through it. The
     * physical interface stays without an IP; sockets bound on the VLAN
     * IP will automatically tag outgoing frames and accept incoming frames
     * matching the configured VID. */
    {
        unsigned int vlan_idx = 0;
        ip4 vip = atoip4(VLAN_IP);
        ip4 vnm = atoip4(VLAN_MASK);
        ip4 vgw = atoip4(VLAN_GW);
        int v_ret;

        uart_puts("Creating VLAN sub-interface VID=");
        uart_putdec((uint32_t)(VLAN_VID));
        uart_puts(" PCP=");
        uart_putdec((uint32_t)(VLAN_PCP));
        uart_puts(" on physical if 0\n");
        v_ret = wolfIP_vlan_create(IPStack, 0, (uint16_t)(VLAN_VID),
                                   (uint8_t)(VLAN_PCP), 0, &vlan_idx);
        if (v_ret < 0) {
            uart_puts("  ERROR: wolfIP_vlan_create failed (-");
            uart_putdec((uint32_t)(-v_ret));
            uart_puts(")\n");
        } else {
            uart_puts("  VLAN sub-iface at idx ");
            uart_putdec((uint32_t)vlan_idx);
            uart_puts("\n  IP: ");
            uart_putip4(vip);
            uart_puts("\n  Mask: ");
            uart_putip4(vnm);
            uart_puts("\n  GW: ");
            uart_putip4(vgw);
            uart_puts("\n");
            wolfIP_ipconfig_set_ex(IPStack, vlan_idx, vip, vnm, vgw);
        }
    }
#else /* ENABLE_VLAN */
#ifdef DHCP
    {
        uint32_t dhcp_start_tick;
        uint32_t dhcp_timeout;
        int dhcp_ret;

