wolfSSL/wolfip/src/port/stm32h563/main.c
        dhcp_timeout = 5000;  /* safety-net tick timeout */

        uart_puts("Starting DHCP client...\n");
        dhcp_ret = dhcp_client_init(IPStack);
        if (dhcp_ret < 0) {
            uart_puts("  DHCP init failed (-");
            uart_putdec((uint32_t)(-dhcp_ret));
            uart_puts(")\n");
        } else {
            uart_puts("  DHCP discover sent, waiting for lease...\n");
            /* Wait for DHCP to complete - poll frequently */
            dhcp_start_tick = tick;
#ifdef DEBUG_H5_ETH
            {
                uint32_t dbg_polls = 0, dbg_pkts = 0;
                volatile uint32_t *probe_ns = (volatile uint32_t *)0x2009aa40u;
                volatile uint32_t *probe_s  = (volatile uint32_t *)0x3009aa40u;
                uint32_t before_ns, after_ns, after_s;
                /* CPU write to NS alias, read back via NS and S */
                before_ns = *probe_ns;
                *probe_ns = 0xC1A55B17u;  /* known pattern */
                __asm volatile ("dsb sy" ::: "memory");
                after_ns = *probe_ns;
                after_s  = *probe_s;
                uart_puts("  PROBE 0x2009aa40 before=0x"); uart_puthex(before_ns);
                uart_puts(" after_ns=0x"); uart_puthex(after_ns);
                uart_puts(" after_s=0x"); uart_puthex(after_s);
                uart_puts("\n");
                stm32_eth_get_stats(&dbg_polls, &dbg_pkts);
                uart_puts("  ETH t0: polls=");
                uart_putdec(dbg_polls);
                uart_puts(" rx_pkts=");
                uart_putdec(dbg_pkts);
                uart_puts(" tx_pkts=");
                uart_putdec(stm32_eth_get_tx_count());
                uart_puts(" mac_tx=");
                uart_putdec(stm32_eth_get_mac_tx_frames());
                uart_puts(" mac_rx=");
                uart_putdec(stm32_eth_get_mac_rx_frames());
                uart_puts(" dmacsr=0x");
                uart_puthex(stm32_eth_get_dmacsr());
                uart_puts("\n");
            }
#endif
            while (!dhcp_bound(IPStack) && dhcp_client_is_running(IPStack)) {
                /* Poll the stack - this processes received packets and sends pending data */
                (void)wolfIP_poll(IPStack, tick);
                /* Increment tick counter (approximate 1ms per iteration at 64MHz HSI)
                 * volatile loop ~8 cycles/iter: 8000 * 8 / 64MHz = 1ms */
                tick++;
                delay(8000);
#ifdef DEBUG_H5_ETH
                if ((tick - dhcp_start_tick) % 500 == 0) {
                    uint32_t dbg_polls = 0, dbg_pkts = 0;
                    stm32_eth_get_stats(&dbg_polls, &dbg_pkts);
                    uart_puts("  ETH t=");
                    uart_putdec(tick - dhcp_start_tick);
                    uart_puts(" rx_pkts=");
                    uart_putdec(dbg_pkts);
                    uart_puts(" tx_pkts=");
                    uart_putdec(stm32_eth_get_tx_count());
                    uart_puts(" mac_tx=");
                    uart_putdec(stm32_eth_get_mac_tx_frames());
                    uart_puts(" mac_rx=");
                    uart_putdec(stm32_eth_get_mac_rx_frames());
                    uart_puts(" rx_crc_err=");
                    uart_putdec(stm32_eth_get_mac_rx_errors());
                    uart_puts(" dmacsr=0x");
                    uart_puthex(stm32_eth_get_dmacsr());
                    uart_puts(" rx_des3=0x");
                    uart_puthex(stm32_eth_get_rx_des3());
                    uart_puts(" tx0_des3=0x");
                    uart_puthex(stm32_eth_get_tx_des3(0));
                    uart_puts("\n");
                }
#endif
                /* Check for timeout */
                if ((tick - dhcp_start_tick) > dhcp_timeout)
                    break;
            }
            if (dhcp_bound(IPStack)) {
                ip4 ip = 0, nm = 0, gw = 0;
                wolfIP_ipconfig_get(IPStack, &ip, &nm, &gw);
                uart_puts("DHCP configuration received:\n");
                uart_puts("  IP: ");
                uart_putip4(ip);
                uart_puts("\n  Mask: ");
                uart_putip4(nm);
                uart_puts("\n  GW: ");
                uart_putip4(gw);
                uart_puts("\n");
            } else {
                ip4 ip = atoip4(WOLFIP_IP);
                ip4 nm = atoip4(WOLFIP_NETMASK);
                ip4 gw = atoip4(WOLFIP_GW);
                uart_puts("  DHCP timeout - falling back to static IP\n");
                uart_puts("  IP: ");
                uart_putip4(ip);
                uart_puts("\n  Mask: ");
                uart_putip4(nm);
                uart_puts("\n  GW: ");
                uart_putip4(gw);
                uart_puts("\n");
                wolfIP_ipconfig_set(IPStack, ip, nm, gw);
            }
        }
    }
#else
    {
        ip4 ip = atoip4(WOLFIP_IP);
        ip4 nm = atoip4(WOLFIP_NETMASK);
        ip4 gw = atoip4(WOLFIP_GW);
        uart_puts("Setting IP configuration:\n");
        uart_puts("  IP: ");
        uart_putip4(ip);
        uart_puts("\n  Mask: ");
        uart_putip4(nm);
        uart_puts("\n  GW: ");
        uart_putip4(gw);
        uart_puts("\n");
        wolfIP_ipconfig_set(IPStack, ip, nm, gw);
    }
#endif
#endif /* ENABLE_VLAN */

#ifdef WOLFIP_USE_FREERTOS
    uart_puts("Starting FreeRTOS BSD socket layer...\n");
    ret = wolfip_freertos_socket_init(IPStack, 4, 1024);
    if (ret < 0) {
        uart_puts("ERROR: FreeRTOS socket init failed\n");
        return 1;
    }

#ifdef ENABLE_HTTPS
    uart_puts("Creating FreeRTOS HTTPS task on port 443...\n");
    ret = https_server_freertos_start(IPStack, HTTPS_WEB_PORT, uart_puts);
    if (ret < 0) {
        uart_puts("ERROR: FreeRTOS HTTPS task init failed\n");
        return 1;
    }
#else
    uart_puts("Creating FreeRTOS TCP echo task on port 7...\n");
    ret = echo_server_freertos_start(IPStack, ECHO_PORT, uart_puts);
    if (ret < 0) {
        uart_puts("ERROR: FreeRTOS echo task init failed\n");
        return 1;
    }
#endif

    uart_puts("Starting FreeRTOS scheduler...\n");
#ifdef ENABLE_HTTPS
    uart_puts("  HTTPS Server: port 443\n");
#else
    uart_puts("  TCP Echo: port 7\n");
#endif
    vTaskStartScheduler();
    uart_puts("ERROR: vTaskStartScheduler returned\n");
    return 1;
#else
    uart_puts("Creating TCP socket on port 7...\n");
    listen_fd = wolfIP_sock_socket(IPStack, AF_INET, IPSTACK_SOCK_STREAM, 0);
    wolfIP_register_callback(IPStack, listen_fd, echo_cb, IPStack);

